//
//  History.h
//  PackList モチメモ
//
//  Created by 松山正和 on 2017/05/05.
//
//

/* 履歴事項を記録する（リソースに組み込まれないようにヘッダコメントにしている）
 --------------------------------------------------------------------------------------

 --------------------------------------------------------------------------------------

 --------------------------------------------------------------------------------------

 --------------------------------------------------------------------------------------
 2017-08-11:アプリ名「モチメモ」を他のアプリ（バンドル）へ移すための手順
 　元アプリ名を「
 　PackListTEL(com.azukid.AzPackingS1)「モチメモ」を「モチメモ Legacy」に変更
  してアプリ1.3.1にアップして審査提出＞手動公開＞公開しない。
 　審査通過後、旧「モチメモ」が解放されるらしい。
 　PackList(com.azukid.AzPackList5)「少し新しいモチメモ」を「モチメモ」に変更してアプリ2.1.3にアップして審査提出＞手動公開＞公開しない。
 --------------------------------------------------------------------------------------
 2017-05-06：バンドルIDの統廃合について
 　モチメモ 2 までに派生バンドルIDが5個存在していた。これを"com.azukid.AzPackList5"に統一することにした。
 　残り4個のIDはモチメモ 2 への移行を終えたものとして廃止、アプリ削除する。
 --------------------------------------------------------------------------------------
 2010年2月16日 2:23　Version 0.2 初公開
 --------------------------------------------------------------------------------------
 2009年9月　着手
 --------------------------------------------------------------------------------------
 */
